name: "zf_part_attention"
input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 224
}

input: "im_info"
input_shape {
  dim: 1
  dim: 3
}

#========= conv1-conv5 ============

layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 96
    kernel_size: 7
    pad: 3
    stride: 2
    # do not initialize from ImageNet pretrained model
    weight_filler { type: "xavier" }
  }
}
layer {
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "norm1"
  type: "LRN"
  bottom: "conv1"
  top: "norm1"
  lrn_param {
    local_size: 3
    alpha: 0.00005
    beta: 0.75
    norm_region: WITHIN_CHANNEL
    engine: CAFFE
  }
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "norm1"
  top: "pool1"
  pooling_param {
    kernel_size: 3
    stride: 2
    pad: 1
    pool: MAX
  }
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 5
    pad: 2
    stride: 2
    # do not initialize from ImageNet pretrained model
    weight_filler { type: "xavier" }
  }
}
layer {
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "norm2"
  type: "LRN"
  bottom: "conv2"
  top: "norm2"
  lrn_param {
    local_size: 3
    alpha: 0.00005
    beta: 0.75
    norm_region: WITHIN_CHANNEL
    engine: CAFFE
  }
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "norm2"
  top: "pool2"
  pooling_param {
    kernel_size: 3
    stride: 2
    pad: 1
    pool: MAX
  }
}
layer {
  name: "conv3"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 384
    kernel_size: 3
    pad: 1
    stride: 1
    # do not initialize from ImageNet pretrained model
    weight_filler { type: "xavier" }
  }
}
layer {
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer {
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 384
    kernel_size: 3
    pad: 1
    stride: 1
    # do not initialize from ImageNet pretrained model
    weight_filler { type: "xavier" }
  }
}
layer {
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer {
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3
    pad: 1
    stride: 1
    # do not initialize from ImageNet pretrained model
    weight_filler { type: "xavier" }
  }
}
layer {
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}

#========= RPN ============

layer {
  name: "rpn_conv/3x3"
  type: "Convolution"
  bottom: "conv5"
  top: "rpn/output"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad: 1 stride: 1
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_relu/3x3"
  type: "ReLU"
  bottom: "rpn/output"
  top: "rpn/output"
}

layer {
  name: "rpn_cls_score"
  type: "Convolution"
  bottom: "rpn/output"
  top: "rpn_cls_score"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 18   # 2(bg/fg) * 9(anchors)
    kernel_size: 1 pad: 0 stride: 1
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
  name: "rpn_bbox_pred"
  type: "Convolution"
  bottom: "rpn/output"
  top: "rpn_bbox_pred"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 36   # 4 * 9(anchors)
    kernel_size: 1 pad: 0 stride: 1
    weight_filler { type: "gaussian" std: 0.01 }
    bias_filler { type: "constant" value: 0 }
  }
}
layer {
   bottom: "rpn_cls_score"
   top: "rpn_cls_score_reshape"
   name: "rpn_cls_score_reshape"
   type: "Reshape"
   reshape_param { shape { dim: 0 dim: 2 dim: -1 dim: 0 } }
}

#========= RoI Proposal ============

layer {
  name: "rpn_cls_prob"
  type: "Softmax"
  bottom: "rpn_cls_score_reshape"
  top: "rpn_cls_prob"
}
layer {
  name: 'rpn_cls_prob_reshape'
  type: 'Reshape'
  bottom: 'rpn_cls_prob'
  top: 'rpn_cls_prob_reshape'
  reshape_param { shape { dim: 0 dim: 18 dim: -1 dim: 0 } }
}

# post_nms_top_n rois generated
layer {
  name: 'proposal'
  type: 'Python'
  bottom: 'rpn_cls_prob_reshape'
  bottom: 'rpn_bbox_pred'
  bottom: 'im_info'
  top: 'rois'
  python_param {
    module: 'rpn.proposal_layer'
    layer: 'ProposalLayer'
    param_str: "'feat_stride': 16"
  }
}

#========= RCNN for roi class prediction ============

layer {
  name: "roi_pool_conv5_class_prediction"
  type: "ROIPooling"
  bottom: "conv5"
  bottom: "rois"
  top: "roi_pool_conv5_class_prediction"
  roi_pooling_param {
    pooled_w: 6
    pooled_h: 6
    spatial_scale: 0.0625 # 1/16
  }
}

#========= prob of proposal cls =========
layer {
  name: "fc6"
  type: "InnerProduct"
  bottom: "roi_pool_conv5_class_prediction"
  top: "fc6"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  inner_product_param {
    num_output: 4096
    weight_filler { type: "xavier" }
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  inner_product_param {
    num_output: 4096
    weight_filler { type: "xavier" }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer {
  name: "cls_score_7"
  type: "InnerProduct"
  bottom: "fc7"
  top: "cls_score"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  inner_product_param {
    num_output: 7
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "cls_prob"
  type: "Softmax"
  bottom: "cls_score"
  top: "cls_prob"
  loss_param {
    ignore_label: -1
    normalize: true
  }
}

#========= Select RoIs for fixed classes ============
layer {
  name: 'select_rois'
  type: 'Python'
  bottom: 'rois'
  bottom: 'cls_prob'
  top: 'select_rois'
  python_param {
    module: 'rpn.roi_select_layer'
    layer: 'RoISelectLayer'
    param_str: "'num_class': 7"
  }
}

#========= RCNN for face attributes prediction ============

layer {
  name: "roi_pool_conv5"
  type: "ROIPooling"
  bottom: "conv5"
  bottom: "select_rois"
  top: "roi_pool_conv5"
  roi_pooling_param {
    pooled_w: 6
    pooled_h: 6
    spatial_scale: 0.0625 # 1/16
  }
}

#========= slice feature maps w.r.t facial parts =========
layer {
  name: "facial_part_slice"
  type: "Slice"
  bottom: "roi_pool_conv5"

  top: "eye_region"
  top: "nose_region"
  top: "mouth_region"
  top: "hair_region"
  top: "neck_region"
  top: "cheek_region"

  slice_param {
    axis: 0
    slice_point: 1
    slice_point: 2
    slice_point: 3
    slice_point: 4
    slice_point: 5
  }
}

######### group_1 feature #########
#========= part attention mask for eye region =========
layer {
  name: "group1_eye_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group1_eye_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_eye_region_attention_relu1"
  type: "ReLU"
  bottom: "group1_eye_region_attention_conv1"
  top: "group1_eye_region_attention_conv1"
}

layer {
  name: "group1_eye_region_attention_pool1"
  type: "Pooling"
  bottom: "group1_eye_region_attention_conv1"
  top: "group1_eye_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group1_eye_region_attention_conv2"
  type: "Convolution"
  bottom: "group1_eye_region_attention_pool1"
  top: "group1_eye_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_eye_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group1_eye_region_attention_conv2"
  top: "group1_eye_region_attention_conv2"
}

layer {
  name: "group1_eye_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group1_eye_region_attention_conv2"
  top: "group1_eye_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group1_eye_region_prod"
  type: "Eltwise"
  bottom: "group1_eye_region_attention_pool2"
  bottom: "eye_region"
  top: "group1_eye_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group1_eye_region_avg"
  type: "Pooling"
  bottom: "group1_eye_region_prod"
  top: "group1_eye_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for nose region =========
layer {
  name: "group1_nose_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group1_nose_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_nose_region_attention_relu1"
  type: "ReLU"
  bottom: "group1_nose_region_attention_conv1"
  top: "group1_nose_region_attention_conv1"
}

layer {
  name: "group1_nose_region_attention_pool1"
  type: "Pooling"
  bottom: "group1_nose_region_attention_conv1"
  top: "group1_nose_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group1_nose_region_attention_conv2"
  type: "Convolution"
  bottom: "group1_nose_region_attention_pool1"
  top: "group1_nose_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_nose_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group1_nose_region_attention_conv2"
  top: "group1_nose_region_attention_conv2"
}

layer {
  name: "group1_nose_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group1_nose_region_attention_conv2"
  top: "group1_nose_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group1_nose_region_prod"
  type: "Eltwise"
  bottom: "group1_nose_region_attention_pool2"
  bottom: "nose_region"
  top: "group1_nose_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group1_nose_region_avg"
  type: "Pooling"
  bottom: "group1_nose_region_prod"
  top: "group1_nose_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for mouth region =========
layer {
  name: "group1_mouth_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group1_mouth_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_mouth_region_attention_relu1"
  type: "ReLU"
  bottom: "group1_mouth_region_attention_conv1"
  top: "group1_mouth_region_attention_conv1"
}

layer {
  name: "group1_mouth_region_attention_pool1"
  type: "Pooling"
  bottom: "group1_mouth_region_attention_conv1"
  top: "group1_mouth_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group1_mouth_region_attention_conv2"
  type: "Convolution"
  bottom: "group1_mouth_region_attention_pool1"
  top: "group1_mouth_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_mouth_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group1_mouth_region_attention_conv2"
  top: "group1_mouth_region_attention_conv2"
}

layer {
  name: "group1_mouth_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group1_mouth_region_attention_conv2"
  top: "group1_mouth_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group1_mouth_region_prod"
  type: "Eltwise"
  bottom: "group1_mouth_region_attention_pool2"
  bottom: "mouth_region"
  top: "group1_mouth_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group1_mouth_region_avg"
  type: "Pooling"
  bottom: "group1_mouth_region_prod"
  top: "group1_mouth_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for hair region =========
layer {
  name: "group1_hair_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group1_hair_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_hair_region_attention_relu1"
  type: "ReLU"
  bottom: "group1_hair_region_attention_conv1"
  top: "group1_hair_region_attention_conv1"
}

layer {
  name: "group1_hair_region_attention_pool1"
  type: "Pooling"
  bottom: "group1_hair_region_attention_conv1"
  top: "group1_hair_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group1_hair_region_attention_conv2"
  type: "Convolution"
  bottom: "group1_hair_region_attention_pool1"
  top: "group1_hair_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_hair_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group1_hair_region_attention_conv2"
  top: "group1_hair_region_attention_conv2"
}

layer {
  name: "group1_hair_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group1_hair_region_attention_conv2"
  top: "group1_hair_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group1_hair_region_prod"
  type: "Eltwise"
  bottom: "group1_hair_region_attention_pool2"
  bottom: "hair_region"
  top: "group1_hair_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group1_hair_region_avg"
  type: "Pooling"
  bottom: "group1_hair_region_prod"
  top: "group1_hair_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for neck region =========
layer {
  name: "group1_neck_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group1_neck_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_neck_region_attention_relu1"
  type: "ReLU"
  bottom: "group1_neck_region_attention_conv1"
  top: "group1_neck_region_attention_conv1"
}

layer {
  name: "group1_neck_region_attention_pool1"
  type: "Pooling"
  bottom: "group1_neck_region_attention_conv1"
  top: "group1_neck_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group1_neck_region_attention_conv2"
  type: "Convolution"
  bottom: "group1_neck_region_attention_pool1"
  top: "group1_neck_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_neck_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group1_neck_region_attention_conv2"
  top: "group1_neck_region_attention_conv2"
}

layer {
  name: "group1_neck_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group1_neck_region_attention_conv2"
  top: "group1_neck_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group1_neck_region_prod"
  type: "Eltwise"
  bottom: "group1_neck_region_attention_pool2"
  bottom: "neck_region"
  top: "group1_neck_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group1_neck_region_avg"
  type: "Pooling"
  bottom: "group1_neck_region_prod"
  top: "group1_neck_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for cheek region =========
layer {
  name: "group1_cheek_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group1_cheek_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_cheek_region_attention_relu1"
  type: "ReLU"
  bottom: "group1_cheek_region_attention_conv1"
  top: "group1_cheek_region_attention_conv1"
}

layer {
  name: "group1_cheek_region_attention_pool1"
  type: "Pooling"
  bottom: "group1_cheek_region_attention_conv1"
  top: "group1_cheek_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group1_cheek_region_attention_conv2"
  type: "Convolution"
  bottom: "group1_cheek_region_attention_pool1"
  top: "group1_cheek_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group1_cheek_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group1_cheek_region_attention_conv2"
  top: "group1_cheek_region_attention_conv2"
}

layer {
  name: "group1_cheek_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group1_cheek_region_attention_conv2"
  top: "group1_cheek_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group1_cheek_region_prod"
  type: "Eltwise"
  bottom: "group1_cheek_region_attention_pool2"
  bottom: "cheek_region"
  top: "group1_cheek_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group1_cheek_region_avg"
  type: "Pooling"
  bottom: "group1_cheek_region_prod"
  top: "group1_cheek_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= features from different region concat =========
layer {
  name: "group1_feature_concat"
  type: "Concat"
  bottom: "group1_eye_region_avg"
  bottom: "group1_nose_region_avg"
  bottom: "group1_mouth_region_avg"
  bottom: "group1_hair_region_avg"
  bottom: "group1_neck_region_avg"
  bottom: "group1_cheek_region_avg"
  top: "group1_feature_concat"
  concat_param {
    axis: 1
  }
}
######### group_1 feature #########

######### group2 feature #########
#========= part attention mask for eye region =========
layer {
  name: "group2_eye_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group2_eye_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_eye_region_attention_relu1"
  type: "ReLU"
  bottom: "group2_eye_region_attention_conv1"
  top: "group2_eye_region_attention_conv1"
}

layer {
  name: "group2_eye_region_attention_pool1"
  type: "Pooling"
  bottom: "group2_eye_region_attention_conv1"
  top: "group2_eye_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group2_eye_region_attention_conv2"
  type: "Convolution"
  bottom: "group2_eye_region_attention_pool1"
  top: "group2_eye_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_eye_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group2_eye_region_attention_conv2"
  top: "group2_eye_region_attention_conv2"
}

layer {
  name: "group2_eye_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group2_eye_region_attention_conv2"
  top: "group2_eye_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group2_eye_region_prod"
  type: "Eltwise"
  bottom: "group2_eye_region_attention_pool2"
  bottom: "eye_region"
  top: "group2_eye_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group2_eye_region_avg"
  type: "Pooling"
  bottom: "group2_eye_region_prod"
  top: "group2_eye_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for nose region =========
layer {
  name: "group2_nose_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group2_nose_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_nose_region_attention_relu1"
  type: "ReLU"
  bottom: "group2_nose_region_attention_conv1"
  top: "group2_nose_region_attention_conv1"
}

layer {
  name: "group2_nose_region_attention_pool1"
  type: "Pooling"
  bottom: "group2_nose_region_attention_conv1"
  top: "group2_nose_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group2_nose_region_attention_conv2"
  type: "Convolution"
  bottom: "group2_nose_region_attention_pool1"
  top: "group2_nose_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_nose_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group2_nose_region_attention_conv2"
  top: "group2_nose_region_attention_conv2"
}

layer {
  name: "group2_nose_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group2_nose_region_attention_conv2"
  top: "group2_nose_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group2_nose_region_prod"
  type: "Eltwise"
  bottom: "group2_nose_region_attention_pool2"
  bottom: "nose_region"
  top: "group2_nose_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group2_nose_region_avg"
  type: "Pooling"
  bottom: "group2_nose_region_prod"
  top: "group2_nose_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for mouth region =========
layer {
  name: "group2_mouth_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group2_mouth_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_mouth_region_attention_relu1"
  type: "ReLU"
  bottom: "group2_mouth_region_attention_conv1"
  top: "group2_mouth_region_attention_conv1"
}

layer {
  name: "group2_mouth_region_attention_pool1"
  type: "Pooling"
  bottom: "group2_mouth_region_attention_conv1"
  top: "group2_mouth_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group2_mouth_region_attention_conv2"
  type: "Convolution"
  bottom: "group2_mouth_region_attention_pool1"
  top: "group2_mouth_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_mouth_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group2_mouth_region_attention_conv2"
  top: "group2_mouth_region_attention_conv2"
}

layer {
  name: "group2_mouth_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group2_mouth_region_attention_conv2"
  top: "group2_mouth_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group2_mouth_region_prod"
  type: "Eltwise"
  bottom: "group2_mouth_region_attention_pool2"
  bottom: "mouth_region"
  top: "group2_mouth_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group2_mouth_region_avg"
  type: "Pooling"
  bottom: "group2_mouth_region_prod"
  top: "group2_mouth_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for hair region =========
layer {
  name: "group2_hair_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group2_hair_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_hair_region_attention_relu1"
  type: "ReLU"
  bottom: "group2_hair_region_attention_conv1"
  top: "group2_hair_region_attention_conv1"
}

layer {
  name: "group2_hair_region_attention_pool1"
  type: "Pooling"
  bottom: "group2_hair_region_attention_conv1"
  top: "group2_hair_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group2_hair_region_attention_conv2"
  type: "Convolution"
  bottom: "group2_hair_region_attention_pool1"
  top: "group2_hair_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_hair_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group2_hair_region_attention_conv2"
  top: "group2_hair_region_attention_conv2"
}

layer {
  name: "group2_hair_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group2_hair_region_attention_conv2"
  top: "group2_hair_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group2_hair_region_prod"
  type: "Eltwise"
  bottom: "group2_hair_region_attention_pool2"
  bottom: "hair_region"
  top: "group2_hair_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group2_hair_region_avg"
  type: "Pooling"
  bottom: "group2_hair_region_prod"
  top: "group2_hair_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for neck region =========
layer {
  name: "group2_neck_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group2_neck_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_neck_region_attention_relu1"
  type: "ReLU"
  bottom: "group2_neck_region_attention_conv1"
  top: "group2_neck_region_attention_conv1"
}

layer {
  name: "group2_neck_region_attention_pool1"
  type: "Pooling"
  bottom: "group2_neck_region_attention_conv1"
  top: "group2_neck_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group2_neck_region_attention_conv2"
  type: "Convolution"
  bottom: "group2_neck_region_attention_pool1"
  top: "group2_neck_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_neck_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group2_neck_region_attention_conv2"
  top: "group2_neck_region_attention_conv2"
}

layer {
  name: "group2_neck_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group2_neck_region_attention_conv2"
  top: "group2_neck_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group2_neck_region_prod"
  type: "Eltwise"
  bottom: "group2_neck_region_attention_pool2"
  bottom: "neck_region"
  top: "group2_neck_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group2_neck_region_avg"
  type: "Pooling"
  bottom: "group2_neck_region_prod"
  top: "group2_neck_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for cheek region =========
layer {
  name: "group2_cheek_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group2_cheek_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_cheek_region_attention_relu1"
  type: "ReLU"
  bottom: "group2_cheek_region_attention_conv1"
  top: "group2_cheek_region_attention_conv1"
}

layer {
  name: "group2_cheek_region_attention_pool1"
  type: "Pooling"
  bottom: "group2_cheek_region_attention_conv1"
  top: "group2_cheek_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group2_cheek_region_attention_conv2"
  type: "Convolution"
  bottom: "group2_cheek_region_attention_pool1"
  top: "group2_cheek_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group2_cheek_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group2_cheek_region_attention_conv2"
  top: "group2_cheek_region_attention_conv2"
}

layer {
  name: "group2_cheek_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group2_cheek_region_attention_conv2"
  top: "group2_cheek_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group2_cheek_region_prod"
  type: "Eltwise"
  bottom: "group2_cheek_region_attention_pool2"
  bottom: "cheek_region"
  top: "group2_cheek_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group2_cheek_region_avg"
  type: "Pooling"
  bottom: "group2_cheek_region_prod"
  top: "group2_cheek_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= features from different region concat =========
layer {
  name: "group2_feature_concat"
  type: "Concat"
  bottom: "group2_eye_region_avg"
  bottom: "group2_nose_region_avg"
  bottom: "group2_mouth_region_avg"
  bottom: "group2_hair_region_avg"
  bottom: "group2_neck_region_avg"
  bottom: "group2_cheek_region_avg"
  top: "group2_feature_concat"
  concat_param {
    axis: 1
  }
}
######### group2 feature #########

######### group3 feature #########
#========= part attention mask for eye region =========
layer {
  name: "group3_eye_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group3_eye_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_eye_region_attention_relu1"
  type: "ReLU"
  bottom: "group3_eye_region_attention_conv1"
  top: "group3_eye_region_attention_conv1"
}

layer {
  name: "group3_eye_region_attention_pool1"
  type: "Pooling"
  bottom: "group3_eye_region_attention_conv1"
  top: "group3_eye_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group3_eye_region_attention_conv2"
  type: "Convolution"
  bottom: "group3_eye_region_attention_pool1"
  top: "group3_eye_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_eye_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group3_eye_region_attention_conv2"
  top: "group3_eye_region_attention_conv2"
}

layer {
  name: "group3_eye_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group3_eye_region_attention_conv2"
  top: "group3_eye_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group3_eye_region_prod"
  type: "Eltwise"
  bottom: "group3_eye_region_attention_pool2"
  bottom: "eye_region"
  top: "group3_eye_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group3_eye_region_avg"
  type: "Pooling"
  bottom: "group3_eye_region_prod"
  top: "group3_eye_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for nose region =========
layer {
  name: "group3_nose_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group3_nose_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_nose_region_attention_relu1"
  type: "ReLU"
  bottom: "group3_nose_region_attention_conv1"
  top: "group3_nose_region_attention_conv1"
}

layer {
  name: "group3_nose_region_attention_pool1"
  type: "Pooling"
  bottom: "group3_nose_region_attention_conv1"
  top: "group3_nose_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group3_nose_region_attention_conv2"
  type: "Convolution"
  bottom: "group3_nose_region_attention_pool1"
  top: "group3_nose_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_nose_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group3_nose_region_attention_conv2"
  top: "group3_nose_region_attention_conv2"
}

layer {
  name: "group3_nose_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group3_nose_region_attention_conv2"
  top: "group3_nose_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group3_nose_region_prod"
  type: "Eltwise"
  bottom: "group3_nose_region_attention_pool2"
  bottom: "nose_region"
  top: "group3_nose_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group3_nose_region_avg"
  type: "Pooling"
  bottom: "group3_nose_region_prod"
  top: "group3_nose_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for mouth region =========
layer {
  name: "group3_mouth_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group3_mouth_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_mouth_region_attention_relu1"
  type: "ReLU"
  bottom: "group3_mouth_region_attention_conv1"
  top: "group3_mouth_region_attention_conv1"
}

layer {
  name: "group3_mouth_region_attention_pool1"
  type: "Pooling"
  bottom: "group3_mouth_region_attention_conv1"
  top: "group3_mouth_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group3_mouth_region_attention_conv2"
  type: "Convolution"
  bottom: "group3_mouth_region_attention_pool1"
  top: "group3_mouth_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_mouth_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group3_mouth_region_attention_conv2"
  top: "group3_mouth_region_attention_conv2"
}

layer {
  name: "group3_mouth_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group3_mouth_region_attention_conv2"
  top: "group3_mouth_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group3_mouth_region_prod"
  type: "Eltwise"
  bottom: "group3_mouth_region_attention_pool2"
  bottom: "mouth_region"
  top: "group3_mouth_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group3_mouth_region_avg"
  type: "Pooling"
  bottom: "group3_mouth_region_prod"
  top: "group3_mouth_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for hair region =========
layer {
  name: "group3_hair_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group3_hair_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_hair_region_attention_relu1"
  type: "ReLU"
  bottom: "group3_hair_region_attention_conv1"
  top: "group3_hair_region_attention_conv1"
}

layer {
  name: "group3_hair_region_attention_pool1"
  type: "Pooling"
  bottom: "group3_hair_region_attention_conv1"
  top: "group3_hair_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group3_hair_region_attention_conv2"
  type: "Convolution"
  bottom: "group3_hair_region_attention_pool1"
  top: "group3_hair_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_hair_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group3_hair_region_attention_conv2"
  top: "group3_hair_region_attention_conv2"
}

layer {
  name: "group3_hair_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group3_hair_region_attention_conv2"
  top: "group3_hair_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group3_hair_region_prod"
  type: "Eltwise"
  bottom: "group3_hair_region_attention_pool2"
  bottom: "hair_region"
  top: "group3_hair_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group3_hair_region_avg"
  type: "Pooling"
  bottom: "group3_hair_region_prod"
  top: "group3_hair_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for neck region =========
layer {
  name: "group3_neck_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group3_neck_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_neck_region_attention_relu1"
  type: "ReLU"
  bottom: "group3_neck_region_attention_conv1"
  top: "group3_neck_region_attention_conv1"
}

layer {
  name: "group3_neck_region_attention_pool1"
  type: "Pooling"
  bottom: "group3_neck_region_attention_conv1"
  top: "group3_neck_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group3_neck_region_attention_conv2"
  type: "Convolution"
  bottom: "group3_neck_region_attention_pool1"
  top: "group3_neck_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_neck_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group3_neck_region_attention_conv2"
  top: "group3_neck_region_attention_conv2"
}

layer {
  name: "group3_neck_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group3_neck_region_attention_conv2"
  top: "group3_neck_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group3_neck_region_prod"
  type: "Eltwise"
  bottom: "group3_neck_region_attention_pool2"
  bottom: "neck_region"
  top: "group3_neck_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group3_neck_region_avg"
  type: "Pooling"
  bottom: "group3_neck_region_prod"
  top: "group3_neck_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for cheek region =========
layer {
  name: "group3_cheek_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group3_cheek_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_cheek_region_attention_relu1"
  type: "ReLU"
  bottom: "group3_cheek_region_attention_conv1"
  top: "group3_cheek_region_attention_conv1"
}

layer {
  name: "group3_cheek_region_attention_pool1"
  type: "Pooling"
  bottom: "group3_cheek_region_attention_conv1"
  top: "group3_cheek_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group3_cheek_region_attention_conv2"
  type: "Convolution"
  bottom: "group3_cheek_region_attention_pool1"
  top: "group3_cheek_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group3_cheek_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group3_cheek_region_attention_conv2"
  top: "group3_cheek_region_attention_conv2"
}

layer {
  name: "group3_cheek_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group3_cheek_region_attention_conv2"
  top: "group3_cheek_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group3_cheek_region_prod"
  type: "Eltwise"
  bottom: "group3_cheek_region_attention_pool2"
  bottom: "cheek_region"
  top: "group3_cheek_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group3_cheek_region_avg"
  type: "Pooling"
  bottom: "group3_cheek_region_prod"
  top: "group3_cheek_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= features from different region concat =========
layer {
  name: "group3_feature_concat"
  type: "Concat"
  bottom: "group3_eye_region_avg"
  bottom: "group3_nose_region_avg"
  bottom: "group3_mouth_region_avg"
  bottom: "group3_hair_region_avg"
  bottom: "group3_neck_region_avg"
  bottom: "group3_cheek_region_avg"
  top: "group3_feature_concat"
  concat_param {
    axis: 1
  }
}
######### group3 feature #########

######### group4 feature #########
#========= part attention mask for eye region =========
layer {
  name: "group4_eye_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group4_eye_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group4_eye_region_attention_relu1"
  type: "ReLU"
  bottom: "group4_eye_region_attention_conv1"
  top: "group4_eye_region_attention_conv1"
}

layer {
  name: "group4_eye_region_attention_pool1"
  type: "Pooling"
  bottom: "group4_eye_region_attention_conv1"
  top: "group4_eye_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group4_eye_region_attention_conv2"
  type: "Convolution"
  bottom: "group4_eye_region_attention_pool1"
  top: "group4_eye_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group4_eye_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group4_eye_region_attention_conv2"
  top: "group4_eye_region_attention_conv2"
}

layer {
  name: "group4_eye_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group4_eye_region_attention_conv2"
  top: "group4_eye_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group4_eye_region_prod"
  type: "Eltwise"
  bottom: "group4_eye_region_attention_pool2"
  bottom: "eye_region"
  top: "group4_eye_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group4_eye_region_avg"
  type: "Pooling"
  bottom: "group4_eye_region_prod"
  top: "group4_eye_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for nose region =========
layer {
  name: "group4_nose_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group4_nose_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group4_nose_region_attention_relu1"
  type: "ReLU"
  bottom: "group4_nose_region_attention_conv1"
  top: "group4_nose_region_attention_conv1"
}

layer {
  name: "group4_nose_region_attention_pool1"
  type: "Pooling"
  bottom: "group4_nose_region_attention_conv1"
  top: "group4_nose_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group4_nose_region_attention_conv2"
  type: "Convolution"
  bottom: "group4_nose_region_attention_pool1"
  top: "group4_nose_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group4_nose_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group4_nose_region_attention_conv2"
  top: "group4_nose_region_attention_conv2"
}

layer {
  name: "group4_nose_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group4_nose_region_attention_conv2"
  top: "group4_nose_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group4_nose_region_prod"
  type: "Eltwise"
  bottom: "group4_nose_region_attention_pool2"
  bottom: "nose_region"
  top: "group4_nose_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group4_nose_region_avg"
  type: "Pooling"
  bottom: "group4_nose_region_prod"
  top: "group4_nose_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for mouth region =========
layer {
  name: "group4_mouth_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group4_mouth_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group4_mouth_region_attention_relu1"
  type: "ReLU"
  bottom: "group4_mouth_region_attention_conv1"
  top: "group4_mouth_region_attention_conv1"
}

layer {
  name: "group4_mouth_region_attention_pool1"
  type: "Pooling"
  bottom: "group4_mouth_region_attention_conv1"
  top: "group4_mouth_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group4_mouth_region_attention_conv2"
  type: "Convolution"
  bottom: "group4_mouth_region_attention_pool1"
  top: "group4_mouth_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group4_mouth_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group4_mouth_region_attention_conv2"
  top: "group4_mouth_region_attention_conv2"
}

layer {
  name: "group4_mouth_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group4_mouth_region_attention_conv2"
  top: "group4_mouth_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group4_mouth_region_prod"
  type: "Eltwise"
  bottom: "group4_mouth_region_attention_pool2"
  bottom: "mouth_region"
  top: "group4_mouth_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group4_mouth_region_avg"
  type: "Pooling"
  bottom: "group4_mouth_region_prod"
  top: "group4_mouth_region_avg"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}

#========= part attention mask for hair region =========
layer {
  name: "group4_hair_region_attention_conv1"
  type: "Convolution"
  bottom: "conv5"
  top: "group4_hair_region_attention_conv1"
  param { lr_mult: 1.0 }
  param { lr_mult: 2.0 }
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group4_hair_region_attention_relu1"
  type: "ReLU"
  bottom: "group4_hair_region_attention_conv1"
  top: "group4_hair_region_attention_conv1"
}

layer {
  name: "group4_hair_region_attention_pool1"
  type: "Pooling"
  bottom: "group4_hair_region_attention_conv1"
  top: "group4_hair_region_attention_pool1"
  pooling_param {
    kernel_size: 2
    stride: 2
    pool: MAX
  }
}

layer {
  name: "group4_hair_region_attention_conv2"
  type: "Convolution"
  bottom: "group4_hair_region_attention_pool1"
  top: "group4_hair_region_attention_conv2"
  param {lr_mult: 1.0}
  param {lr_mult: 2.0}
  convolution_param {
    num_output: 256
    kernel_size: 3 pad:1 stride:1
    weight_filler { type: "xavier" }
  }
}

layer {
  name: "group4_hair_region_attnetion_relu2"
  type: "ReLU"
  bottom: "group4_hair_region_attention_conv2"
  top: "group4_hair_region_attention_conv2"
}

layer {
  name: "group4_hair_region_attention_pool2"
  type: "GRIDPooling"
  bottom: "group4_hair_region_attention_conv2"
  top: "group4_hair_region_attention_pool2"
  grid_pooling_param {
    pooled_w: 6
    pooled_h: 6
  }
}

layer {
  name: "group4_hair_region_prod"
  type: "Eltwise"
  bottom: "group4_hair_region_attention_pool2"
  bottom: "hair_region"
  top: "group4_hair_region_prod"
  eltwise_param {
    operation: PROD
  }
}

layer {
  name: "group4_hair_region_avg"
